Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/separation_and_divorce/judicial_separation.html.txt.tmx
Source language: en
Languages: ga

source: When a couple cannot agree the terms by which they will live separately, an application to the courts for a decree of judicial separation can be made by either party
ga: Nuair nach féidir le lánúin comhaontú ar na téarmaí faoina gcónóidh siad amuigh óna chéile, is féidir le ceachtar den bheirt iarratas a dhéanamh ar na cúirteanna ar idirscaradh breithiúnach

source: The court must be satisfied that:
ga: Ní mór go bhfuil an chúirt sásta faoin méid a leanas:

source: • The grounds for the application exist
ga: • •Tá forais leis an iarratas

source: • The couple has been advised about counselling and mediation
ga: • •Cuireadh an lánúin ar an eolas ar chomhairleoireacht agus idirghabháil

source: • Proper provision has been made for the welfare of any dependants
ga: • •Rinneadh soláthar cuí ar mhaithe le leas aon chleithiúnaithe

source: If it is satisfied, the court will grant a decree of judicial separation
ga: Má tá an Chúirt sásta, deonóidh sí foraithne idirscartha bhreithiúnaigh

source: The decree confirms that the couple is no longer obliged to live together as a married couple
ga: Deimhnítear san fhoraithne nach bhfuil dualgas a thuilleadh ar an lánúin cónaí le chéile mar lánúin phósta

source: The court may also make orders in relation to custody and access to children, the payment of maintenance and lump sums, the transfer of property, the extinguishment of succession rights, etc
ga: Chomh maith leis sin, féadfaidh an chúirt orduithe a dhéanamh maidir le caomhnóireacht agus rochtain ar leanaí, agus cnapshuimeanna agus cothabháil a íoc, maoin a aistriú, cearta comharbais a chur ar ceal etc

source: An application for a judicial separation is made either in the Circuit Court or the High Court
ga: Déantar iarratas ar idirscaradh breithiúnach ar an gCúirt Chuarda nó ar an Ard-Chúirt

source: As in all family law matters, cases are heard in private and the public is not admitted to the courtroom
ga: Bíonn na héisteachtaí ar fad príobháideach agus ní thugtar cead isteach do bhaill den phobal sa seomra cúirte, ar nós a bhíonn i gceist i ngach ceist dlí teaghlaigh

source: You cannot apply for a judicial separation when you already have in force a separation agreement which has been made an order of court
ga: Ní féidir leat iarratas a dhéanamh ar idirscaradh breithiúnach nuair atá comhaontú idirscartha i bhfeidhm agat cheana féin a ndearnadh ordú cúirte de

source: An application for a judicial separation must be based on one of the following six grounds:
ga: Ní mór go bhfuil iarratas ar idirscaradh breithiúnach bunaithe ar cheann amháin de na sé fhoras a leanas:

source: • One party has committed adultery
ga: • Go ndearna páirtí amháin adhaltranas

source: • One party has behaved in such a way that it would be unreasonable to expect the other spouse to continue to live with them
ga: • Bhí iompar den chineál sin ar bun ag páirtí amháin go mbeadh sé míréasúnta a bheith ag súil leis go leanfadh an céile eile ag cónaí leo

source: • One party has deserted the other for at least one year at the time of the application
ga: • Thréig páirtí amháin an páirtí eile ar feadh bliana ar a laghad roimh an tráth a dhéantar an t-iarratas

source: • The parties have live apart from one another for one year up to the time of the application and both parties agree to the decree being granted
ga: • Chónaigh na páirtithe amuigh óna chéile ar feadh bliana roimh an tráth a dhéantar an t-iarratas agus comhaontaíonn an bheirt pháirtithe le deonú na foraithne

source: • The parties have lived apart from one another for at least three years at the time of the application for the decree (whether or not both parties agree to the decree being granted)
ga: • Chónaigh na páirtithe amuigh óna chéile ar feadh trí bliana ar a laghad ag an tráth a dhéantar an t-iarratas ar an bhforaithne (cé acu má nó chomhaontaíonn nó mura gcomhaontaíonn an bheirt pháirtithe le deonú na foraithne)

source: • The court considers that a normal marital relationship has not existed between the spouses for at least one year before the date of the application for the decree
ga: • Measann an chúirt nach raibh gnáthchaidreamh pósta idir na céilí ar feadh bliana ar a laghad roimh an dáta a rinneadh an t-iarratas ar an bhforaithne

source: The last is by far the most common ground on which the decree is granted, as neither party has to be shown as being at fault
ga: Is é an foras deiridh an foras is mó is coitianta ar a ndeonaítear foraithne, mar gheall nach dtugtar le fios go bhfuil an locht ar cheachtar páirtí

source: When you are applying for a judicial separation you must submit four documents to the Circuit Court:
ga: Nuair a bhíonn iarratas á dhéanamh agat ar idirscaradh breithiúnach, ní mór duit ceithre cháipéis a sheoladh chuig an gCúirt Chuarda:

source: • An application form (known as a family law civil bill)
ga: • Foirm iarratais (ar a dtugtar bille sibhialta dlí teaghlaigh)

source: This document describes both you and your spouse, your occupations and where you live
ga: Déantar cur síos sa cháipéis seo ort féin agus ar do chéile, bhur ngairmeacha beatha agus cén áit a gcónaíonn sibh

source: It also sets out when you married, for how long you have been living apart and the names and birth dates of your children
ga: Leagtar amach inti, chomh maith, cathain a phós sibh, cé chomh fada atá sibh ag cónaí amuigh óna chéile agus ainmneacha agus dátaí breithe bhur leanaí

source: • A sworn statement of means
ga: • Ráiteas acmhainne faoi mhionn

source: This document sets out your assets, your income, your debts and liabilities and your outgoings
ga: Leagtar amach sa cháipéis seo do shócmhainní, d’ioncam, d’fhiachas, do dhliteanais agus d’eisíocaíochtaí

source: • A sworn statement relating to the welfare of your children
ga: • Ráiteas faoi mhionn a bhaineann le leas do leanaí

source: This document sets out the personal details of the children of the marriage
ga: Leagtar amach sa cháipéis seo sonraí pearsanta faoi leanaí an phósta

source: It describes where they live and with whom
ga: Déantar cur síos sa cháipéis ar an áit a gcónaíonn siad agus na daoine a gcónaíonn siad leo

source: It also describes their education and training, their health, childcare arrangements and maintenance and access arrangements
ga: Déantar cur síos sa cháipéis seo ar a n-oideachas agus oiliúint, a sláinte, socruithe cúram leanaí agus socruithe cothabhála agus rochtana

source: • A document certifying that you have been advised of the alternatives to judicial separation
ga: • Cáipéis ina ndeimhnítear gur cuireadh ar an eolas thú faoi na roghanna eile ar idirscaradh breithiúnach

source: This document is sworn by a solicitor and it certifies that you have discussed the options of reconciliation, mediation and separation agreements
ga: Mionnaíonn aturnae an cháipéis seo agus deimhníonn sí go ndearna tú plé ar roghanna na hidirghabhála agus comhaontuithe idirscartha

source: When both you and your spouse have filed all of the necessary documents, you will be given a date for the court hearing
ga: Nuair a bhíonn na cáipéisí riachtanacha go léir comhdaithe agat agus ag do chéile, tabharfar dáta duit don éisteacht chúirte

source: The hearing will be held in private and you will need to show the court that you meet the requirements of the Judicial Separation and Family Law Reform Act 1989
ga: Beidh an éisteacht ar siúl go príobháideach agus beidh ort a thaispeáint don chúirt go gcomhlíonann tú ceanglais an Achta um Idirscaradh Breithiúnach agus Athchóiriú an Dlí Teaghlaigh, 1989

source: You can read more about the factors considered by a court in a judicial separation case here
ga: Is féidir leat tuilleadh a léamh faoi thosca a ndéanann cúirt breithniú orthu i gcás idirscartha bhreithiúnaigh anseo

source: If the court is satisfied that you have grounds for a judicial separation, it will grant a decree
ga: Má tá an chúirt sásta go bhfuil forais agat le haghaidh idirscaradh breithiúnach, deonóidh sí foraithne

source: Further information on applying for a judicial separation is available on the Courts Service website
ga: Tá fáil ar bhreis faisnéise ar iarratas a dhéanamh ar idirscaradh breithiúnach ar láithreán gréasáin na Seirbhíse Cúirteanna

source: A decree of judicial separation does not give you the right to remarry
ga: Ní bhronnann foraithne idirscartha bhreithiúnaigh an ceart ort chun athphósadh nó chun iontráil i bpáirtnéireacht shibhialta

source: You are not legally required to use a solicitor or a barrister
ga: Níl ceanglas dlíthiúil ort aturnae nó abhcóide a úsáid

source: In fact, if you wish, you can choose to represent yourself
ga: Féadfaidh tú, más mian leat, a roghnú chun ionadaíocht a dhéanamh duit féin, i bhfírinne

source: However, there may be complex issues which may make it very difficult to apply for a judicial separation without any professional help
ga: D’fhéadfadh saincheisteanna casta a bheith i gceist, áfach, a chruthaíonn mórdheacrachtaí duit iarratas a dhéanamh ar idirscaradh breithiúnach gan aon chabhair ghairmiúil

source: The family law civil bill and sample forms for the statement of means, the statement on children's welfare and the certificate that you have been advised of alternatives are available from the Courts Service website
ga: Tá an Bille Sibhialta um an Dlí Teaghlaigh agus foirmeacha samplacha don ráiteas acmhainne, an ráiteas ar leas linbh agus an deimhniú gur cuireadh ar an eolas thú ar roghanna eile ar fáil ó láithreán gréasáin na Seirbhíse Cúirteanna

source: You can also obtain copies of these forms, and the family law civil bill, from your nearest Circuit Court Office
ga: Chomh maith leis sin, féadfaidh tú cóipeanna a fháil de na foirmeacha seo, agus den Bhille um an Dlí Teaghlaigh, ó Oifig na Cúirte Cuarda is gaire duit

source: Legal advice and representation is always advisable
ga: Moltar i gcónaí comhairle dlí agus ionadaíocht a fháil

source: You and your spouse should not use the same solicitor
ga: Níor cheart duit féin agus do chéile an t-aturnae céanna a úsáid

source: To enquire whether you are eligible for Legal Aid, you can contact your nearest law centre
ga: Chun fiosrúchán a dhéanamh faoi cibé acu an bhfuil nó nach bhfuil tú incháilithe do Chúnamh Dlí, déan teagmháil leis an ionad dlí is gaire duit

source: Legal Aid is not free and everyone must pay a contribution towards costs
ga: Níl cúnamh dlí saor in aisce agus tá ar gach duine ranníocaíocht a íoc i dtreo na gcostas

source: FLAC (Free Legal Advice Centres) is an independent, voluntary organisation that operates a network of legal advice clinics throughout the country
ga: Is eagraíocht neamhspleách, dheonach é ICDS (Ionaid Chomhairle Dlí Saor in Aisce) a oibríonn líonra de chlinicí um chomhairle dhlíthiúil ar fud na tíre

source: These clinics are confidential, free of charge and open to all
ga: Tá na clinicí seo faoi rún agus saor in aisce do chách

source: Contact your nearest Citizens Information Centre for information on FLAC services in your area
ga: Déan teagmháil leis an Ionad um Fhaisnéis do Shaoránaigh is gaire duit chun teacht ar fhaisnéis ar sheirbhísí ICDS i do cheantar

source: FLAC also runs an information and referral line during office hours for basic legal information
ga: Ina theannta sin, tá líne faisnéise agus atreoraithe á reáchtáil ag ICDS le linn uaireanta oifige le haghaidh faisnéis bhunúsach dhlíthiúil

source: If you choose to hire a private solicitor, you should be aware that there is no fixed rate of charges for legal fees
ga: Ma roghnaíonn tú chun aturnae príobháideach a fhruiliú, ba cheart duit a bheith feasach nach ann d’aon ráta seasta muirear le haghaidh táillí dlí

source: You are advised to obtain some quotes before deciding on a legal firm
ga: Moltar duit roinnt meastacháin luacha a fháil sula ndéanann tú cinneadh ar ghnóthas dlíthiúil

source: Contact information for solicitors firms throughout Ireland is available on the Law Society website
ga: Tá fáil ar fhaisnéis teagmhála do ghnóthais aturnaetha ar fud na hÉireann ar láithreán gréasáin Dhlí-Chumann na hÉireann
